Friends | List of all members
ACAPI::MEP::v1::DuctSegmentPreferenceTableContainer Class Referencefinal
MEP Element Manager
The DuctSegmentPreferenceTableContainer can contain several PreferenceTableBase associated with ventilation. More...
#include <MEPDuctSegmentPreferenceTableContainer.hpp>
 Inheritance diagram for ACAPI::MEP::v1::DuctSegmentPreferenceTableContainer:
 Friends
Result< DuctSegmentPreferenceTableContainer >  | GetDuctSegmentPreferenceTableContainer ()
 Additional Inherited Members
 Public Member Functions inherited from ACAPI::MEP::v1::PreferenceTableContainerBase
bool  | Exists () const
std::vector< UniqueID >  | GetPreferenceTables () const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
Result< UniqueID >  | AddNewTable (GS::UniString tableName, const std::optional< API_Guid > &requiredId=std::nullopt)
Inserts a new PreferenceTable into the container.
Result< void >  | Delete (const UniqueID &uniqueId)
Deletes a PreferenceTable from the container.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions inherited from ACAPI::MEP::v1::PreferenceTableContainerBase
PreferenceTableContainerBase (std::shared_ptr< Impl::IPreferenceTableContainerBaseImpl > impl)
Constructs a PreferenceTableContainerBase with the given base implementation.
Modifier (PreferenceTableContainerBase &parent)
Constructs a Modifier with the given PreferenceTableContainerBase.
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The DuctSegmentPreferenceTableContainer can contain several PreferenceTableBase associated with ventilation.
Since
Archicad 27
The container is already initialized (but may be empty) and you can access it by calling GetDuctSegmentPreferenceContainer.
Example code snippet from Test / New MEP
Take a look at PreferenceTableContainerBase
Friends And Related Symbol Documentation
◆ GetDuctSegmentPreferenceTableContainer
 Result< DuctSegmentPreferenceTableContainer > GetDuctSegmentPreferenceTableContainer  |  ( |   | )
friend
Returns
If able, returns the DuctPreferenceTableContainer from the project.